server/artillery/result/NGINX_or_Direct/커뮤니티내사용자10초10명NGINX/api_test.yaml
config:
  target : 'http://49.50.167.202:80'
  phases:
#    - duration: 60
#      arrivalRate: 5
#      name: Warm up
#    - duration: 120
#      arrivalRate: 5
#      rampTo: 50
#      name: Ramp up load
    - duration: 10
      arrivalRate: 10
      name: Sustained load

before:
  flow:
    - post:
        url : '/api/user/auth/signin'
        json:
          id: 'kny@gmail.com'
          password: '12341234'
        capture:
          json: '$.result.accessToken'
          as: accessToken
        expect:
          - statusCode: 201
scenarios:
  - flow:
#      - get:
#          url: '/api/users?search=t'
#        headers:
#          authorization: 'Bearer {{accessToken}}'
#      - get:
#          url: '/api/user/followings'
#          headers:
#            authorization: 'Bearer {{accessToken}}'
#      - think : 1
#      - get:
#          url: '/api/communities'
#          headers:
#            authorization: 'Bearer {{accessToken}}'
#      - think : 1
      - get:
          url: '/api/communities/63956c42d1a615bf564e3af6/users'
          headers:
            authorization: 'Bearer {{accessToken}}'